{
    "name": "Stargate Exceptions",
    "icon": "sgjourney:classic_stargate",
    "category": "patchouli:strangeguide/gameplaychanges",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "While most dimensions have had their ordinary means of travel disabled, there are a few that are more 'technical' dimensions that haven't. Those exceptions are listed here."
        },
        {
            "type": "patchouli:spotlight",
            "title": "The Demon Realm",
            "item": "bloodmagic:ritualdiviner",
            "text": "As much as I would legitmately love to have this accessible via stargate, it's just not possible! The dungeon is dynamically and procedurally generated when using the portal spawned by the Ritual."
        },
        {
            "type": "patchouli:spotlight",
            "title": "Spatial Storage",
            "item": "ae2:spatial_storage_cell_128",
            "text": "Applied Energistics 2's Spatial Storage dimension, a place where pockets of space are stored so that entities and players can be taken along with them, wouldn't make sense as part of the network. It's supposed to be inside the disk and only handled as a dimension for technical reasons."
        },
        {
            "type": "patchouli:spotlight",
            "title": "The Past",
            "item": "graveyard:corruption",
            "text": "This is an unfinished, inaccessible dimension from The Graveyard left in the mod. It was never accessible in the first place, and many of the blocks making it up don't even have item forms yet, but I've listed it here in case you see it in the dimension registry or your logs."
        },
        {
            "type": "patchouli:spotlight",
            "title": "The Bowels",
            "item": "witherstormmod:withered_nether_star",
            "text": "This dimension is visited as part of a boss fight, it's supposed to be the insides of an enemy."
        },
        {
            "type": "patchouli:spotlight",
            "title": "Dimensional Dungeon",
            "item": "dimdungeons:item_portal_key",
            "text": "Similar to Blood Magic's Demon Realm, the Dimensional Dungeon is procedurally generated by using keys from the mod."
        },
        {
            "type": "patchouli:spotlight",
            "title": "Personal Dimension",
            "item": "dimdungeons:item_key_build",
            "text": "This is a dimension used to store a personal building area for players, whether a pocket dimension base or otherwise. If you do put a Stargate here, I'd definitely suggest an Iris."
        },
        {
            "type": "patchouli:spotlight",
            "title": "Limbo.",
            "item": "dimdoors:monolith_spawner",
            "text": "$(k)Limbo is from Dimensional doors, and a famously absurdly creepy place. You can get there from falling into the void or dying in a pocket dimension, but this modpack has actually changed it so that falling into the void in ANY dimension (save for the Aether) will drop you right into Limbo. Have fun, and try not to soil yourself." 
        },
        {
            "type": "patchouli:spotlight",
            "title": "Dimensional Doors",
            "item": "dimdoors:item_ag_dim_minecraft_oak_door,dimdoors:item_ag_dim_minecraft_iron_door,dimdoors:item_ag_dim_dimdoors_gold_door,dimdoors:item_ag_dim_dimdoors_quartz_door",
            "text": "All dungeons related to Dimensional Doors are either procedurally generated or player generated, thus they exist outside the Stargate Network."
        }
    ]
}
